app/Models/ComAttchModel.php

SELECT *
FROM `compattachment`
WHERE `compCustResKey` = '1'
---
    function find_whr($acompCustResKey)
    {
        #print("from acc model check user");

        $builder = $this->db->table('compattachment');

        $records = $builder
                    ->where(['compCustResKey' => $acompCustResKey])
                    ->get()->getResult();