app/Models/ComAdsModel.php

    function find_whr($compkey)
    {
        #print("from acc model check user");

        $builder = $this->db->table('compad');

        $records = $builder
                    ->where(['compKey' => $compkey])
                    ->get()->getResult();
---
SELECT *
FROM `compad`
WHERE `compKey` = '1'