app/Models/ComDprtmntModel.php

    function find_whr($compkey)
    {
        #print("from acc model check user");

        $builder = $this->db->table('compdep');

        $records = $builder
                    ->where(['compKey' => $compkey])
                    ->get()->getResult();
---
SELECT *
FROM `compdep`
WHERE `compKey` = '1'