app/Models/CompDdtModel.php

SELECT *
FROM `comdfdt`
WHERE `compKey` = '1'
---
    function find_whr($compkey)
    {
        #print("from acc model check user");
        //`dfdtId`, `compKey`, `dfdtday`, `dfdtperiod`, `dfdtfrom`, `dfdtto`, `dfdtduration`, `dfdtclosebefore`, `dfdtsmartview`
        $builder = $this->db->table('comdfdt');

        $records = $builder
                    ->where(['compKey' => $compkey])
                    ->get()->getResult();