app/Models/CompAccModel.php

SELECT *
FROM `compacc`
WHERE `compKey` = '1'
AND `compAccTypeKey` < '3'
---
    function find_whr($compKey)
    {
        $builder = $this->db->table('compacc');
        $records = $builder
                    ->where(['compKey' => $compKey])
                    ->where(['compAccTypeKey < ' => '3'])
                    ->get()->getResult();

SELECT *
FROM `compacc`
WHERE `accId` = '1'
---
    function find_by_accId($aAccId)
    {
        $builder = $this->db->table('compacc');
        $records = $builder
                    ->where(['accId' => $aAccId])
                    ->get()->getResult();