app/Models/CompWklySrvDdtModel.php

SELECT `wklyDtCrd`
FROM `compwklysrvdt`
WHERE `compSrvKey` = '75'
GROUP BY `wklyDtCrd`
---
    function find_dst_sdc($compSrvKey)
    {


	$builder = $this->db->table('compwklysrvdt');

        $records = $builder
		    ->select(array('wklyDtCrd'))
		    ->where(['compSrvKey' => $compSrvKey])
	            ->groupBy('wklyDtCrd')
                    ->get()->getResult();

SELECT `wklyDtCrd`
FROM `compwklysrvdt`
WHERE `compSrvKey` = '75'
AND `wklyDtCrd` >= '2022-09-04'
GROUP BY `wklyDtCrd`
---
    function find_upcmng_wks($compSrvKey, $tDate)
    {
	$builder = $this->db->table('compwklysrvdt');
        $records = $builder
		    ->select(array('wklyDtCrd'))
		    ->where(['compSrvKey' => $compSrvKey])
		    ->where(['wklyDtCrd>= ' => $tDate])
		    ->groupBy('wklyDtCrd')
                    ->get()->getResult();

INSERT INTO `compwklysrvdt` (`wklyDtCrd`, `compKey`, `compSrvKey`, `srvDtDay`, `srvDtPeriod`, `srvDtFrom`, `srvDtTo`, `srvDtDur`, `srvDtCloseBf`, `srvDtSmartView`, `srvDtIsActive`) VALUES ('2022-09-11', '1', '75', 'Sunday', '1', '06:00', '10:00', '60', '1', '1', '1')
---
    function insert_record($awklyDtCrd, $aCompKey, $acompSrvKey, $asrvDtDay,
                            $asrvDtPeriod, $asrvDtFrom, $asrvDtTo,
                            $asrvDtDur, $asrvDtCloseBf, $asrvDtSmartView,
                            $asrvDtIsActive)
    {
        $data = array(
	    'wklyDtCrd'			=> $awklyDtCrd,
            'compKey'                   => $aCompKey,
            'compSrvKey'                => $acompSrvKey,
            'srvDtDay'                  => $asrvDtDay,
            'srvDtPeriod'               => $asrvDtPeriod,
            'srvDtFrom'                 => $asrvDtFrom,
            'srvDtTo'                   => $asrvDtTo,
            'srvDtDur'                  => $asrvDtDur,
            'srvDtCloseBf'              => $asrvDtCloseBf,
            'srvDtSmartView'            => $asrvDtSmartView,
            'srvDtIsActive'             => $asrvDtIsActive,
        );

        $builder = $this->db->table('compwklysrvdt');
        $builder->insert($data);