app/Models/ComPagesModel.php

    function find_whr($compkey)
    {
        #print("from acc model check user");
        $builder = $this->db->table('compages');

        $records = $builder
                    ->where(['compKey' => $compkey])
                    ->get()->getResult();
---
SELECT *
FROM `compages`
WHERE `compKey` = '1'