app/Models/CompColorsModel.php

SELECT *
FROM `compcolors`
WHERE `compKey` = '1'
---
    function find_whr($compkey)
    {
        $builder = $this->db->table('compcolors');
        $records = $builder
                    ->where(['compKey' => $compkey])
                    ->get()->getResult();