app/Models/CompServiceModel.php

    function find_all_servs($aCompKey)
    {
        $builder = $this->db->table('compservice');
        $records = $builder
                    ->where('compKey', $aCompKey)
                    ->get()->getResult();
---
SELECT *
FROM `compservice`
WHERE `compKey` = '1'

    function find_whr($srvId)
    {
        $builder = $this->db->table('compservice');
        $records = $builder
                    ->where('srvId', $srvId)
                    ->get()->getResult();
---
SELECT *
FROM `compservice`
WHERE `srvId` = '73'

    function find_whr_brnch($acmpSrvBrnch)
    {
        $builder = $this->db->table('compservice');
        $records = $builder
                    ->where('cmpSrvBrnch', $acmpSrvBrnch)
		    ->where('srvArc', 0)
                    ->get()->getResult();
---
SELECT *
FROM `compservice`
WHERE `cmpSrvBrnch` = '1'
AND `srvArc` = 0

    function find_whr_brnch_nDep($acmpSrvBrnch, $acmpSrvDep)
    {
        $builder = $this->db->table('compservice');
        $records = $builder
                    ->where('cmpSrvBrnch', $acmpSrvBrnch)
		    ->where('depKey', $acmpSrvDep)
		    ->where('srvArc', 0)
                    ->get()->getResult();
---
SELECT *
FROM `compservice`
WHERE `cmpSrvBrnch` = '1'
AND `depKey` = '1'
AND `srvArc` = 0

    function join_records($compkey)
    {
        $builder = $this->db->table('compservice');
        $builder
        ->join('compbranch', 'compbranch.branchID = compservice.cmpSrvBrnch')
        ->join('compdep', 'compdep.DepID = compservice.depKey');
        $query = $builder->get()->getResult();
---
SELECT *
FROM `compservice`
JOIN `compbranch` ON `compbranch`.`branchID` = `compservice`.`cmpSrvBrnch`
JOIN `compdep` ON `compdep`.`DepID` = `compservice`.`depKey`