app/Models/ComRsrvModel.php

SELECT *
FROM `compcustres`
WHERE `compSrvKey` = '75'
AND `custResDt` > '2022-09-03 00:00:00'
AND `custResDt` < '2022-09-05 00:00:00'
---
    function find_srv_sdt($acompSrvKey, $y_day, $t_day)
    {

        $builder = $this->db->table('compcustres');
        $records = $builder
                    ->where(['compSrvKey' => $acompSrvKey])
                    ->where(['custResDt > ' => $y_day])
                    ->where(['custResDt < ' => $t_day])
                    ->get()->getResult();

INSERT INTO `compcustres` (`compKey`, `compAccKey`, `vstrNam`, `compSrvKey`, `custResDt`, `custResAttended`) VALUES ('1', '1', 'Faisa', '75', '2022-09-07 17:00:00', 0)
---
    function insert_record($aCompKey, $aCompAccKey, $avstrNam, $aCompSrvKey, $aCustResDt, $aCustResAttended)
    {
        #`vstrNam``compDepKey
        $data = array(
            'compKey'           => $aCompKey,
            'compAccKey'        => $aCompAccKey,
            'vstrNam'           => $avstrNam,
            'compSrvKey'        => $aCompSrvKey,
            'custResDt'         => $aCustResDt,
            'custResAttended'   => $aCustResAttended,
        );

        $builder = $this->db->table('compcustres');
        $builder->insert($data);

DELETE FROM `compcustres`
WHERE `custResID` = '294'
---
    function delete_record($aCustResID)
    {
        $builder = $this->db->table('compcustres');
        $builder
        ->where('custResID', $aCustResID)
        ->delete();