app/Models/ComRsrvModel.php

SELECT *
FROM `compcustres`
WHERE `compAccKey` = '1'
AND `custResAttended` > '-1'
---
    function find_cust($acompAccKey)
    {
        $builder = $this->db->table('compcustres');
        $records = $builder
                    ->where(['compAccKey' => $acompAccKey])
		            ->where(['custResAttended > ' => '-1'])
                    ->get()->getResult();